[6322_IT_2024-08-19.txt](https://github.com/user-attachments/files/16664405/6322_IT_2024-08-19.txt)

TF plan for deploy to `dev.shared` (deploy not performed)
```
Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.root_user will be destroyed
  # (because aws_cloudwatch_log_metric_filter.root_user is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "root_user" {
      - id             = "azul-root_user-dev.filter" -> null
      - log_group_name = "azul-trail-dev" -> null
      - name           = "azul-root_user-dev.filter" -> null
      - pattern        = "{$.userIdentity.type=\"Root\" && $.userIdentity.invokedBy NOT EXISTS && $.eventType !=\"AwsServiceEvent\"}" -> null

      - metric_transformation {
          - dimensions    = {} -> null
          - name          = "root_user_metric" -> null
          - namespace     = "LogMetrics" -> null
          - unit          = "None" -> null
          - value         = "1" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.root_user will be destroyed
  # (because aws_cloudwatch_metric_alarm.root_user is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "root_user" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ] -> null
      - alarm_name                            = "azul-root_user-dev.alarm" -> null
      - arn                                   = "arn:aws:cloudwatch:us-east-1:122796619775:alarm:azul-root_user-dev.alarm" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "azul-root_user-dev.alarm" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "root_user_metric" -> null
      - namespace                             = "LogMetrics" -> null
      - ok_actions                            = [
          - "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ] -> null
      - period                                = 300 -> null
      - statistic                             = "Sum" -> null
      - tags                                  = {
          - "Name"                = "azul-root_user"
          - "billing"             = "hca"
          - "component"           = "azul-root_user"
          - "deployment"          = "dev"
          - "owner"               = "hannes@ucsc.edu"
          - "service"             = "azul"
          - "terraform_component" = "shared"
        } -> null
      - tags_all                              = {
          - "Name"                = "azul-root_user"
          - "billing"             = "hca"
          - "component"           = "azul-root_user"
          - "deployment"          = "dev"
          - "owner"               = "hannes@ucsc.edu"
          - "service"             = "azul"
          - "terraform_component" = "shared"
        } -> null
      - threshold                             = 0 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_securityhub_standards_control.nist_control_acm_1 will be created
  + resource "aws_securityhub_standards_control" "nist_control_acm_1" {
      + control_id                = (known after apply)
      + control_status            = "DISABLED"
      + control_status_updated_at = (known after apply)
      + description               = (known after apply)
      + disabled_reason           = "Not a moderate level control"
      + id                        = (known after apply)
      + related_requirements      = (known after apply)
      + remediation_url           = (known after apply)
      + severity_rating           = (known after apply)
      + standards_control_arn     = "arn:aws:securityhub:us-east-1:122796619775:control/nist-800-53/v/5.0.0/ACM.1"
      + title                     = (known after apply)
    }

  # aws_securityhub_standards_control.nist_control_cloudfront_1 will be created
  + resource "aws_securityhub_standards_control" "nist_control_cloudfront_1" {
      + control_id                = (known after apply)
      + control_status            = "DISABLED"
      + control_status_updated_at = (known after apply)
      + description               = (known after apply)
      + disabled_reason           = "Not a moderate level control"
      + id                        = (known after apply)
      + related_requirements      = (known after apply)
      + remediation_url           = (known after apply)
      + severity_rating           = (known after apply)
      + standards_control_arn     = "arn:aws:securityhub:us-east-1:122796619775:control/nist-800-53/v/5.0.0/CloudFront.1"
      + title                     = (known after apply)
    }

  # aws_securityhub_standards_control.nist_control_macie_1 must be replaced
-/+ resource "aws_securityhub_standards_control" "nist_control_macie_1" {
      ~ control_id                = "Macie.1" -> (known after apply)
      ~ control_status_updated_at = "2024-03-05T00:26:22Z" -> (known after apply)
      ~ description               = "This control checks whether Amazon Macie is enabled for an account. The control fails if Macie isn't enabled for the account." -> (known after apply)
      ~ id                        = "arn:aws:securityhub:us-east-1:122796619775:control/aws-foundational-security-best-practices/v/1.0.0/Macie.1" -> (known after apply)
      ~ related_requirements      = [] -> (known after apply)
      ~ remediation_url           = "https://docs.aws.amazon.com/console/securityhub/Macie.1/remediation" -> (known after apply)
      ~ severity_rating           = "MEDIUM" -> (known after apply)
      ~ standards_control_arn     = "arn:aws:securityhub:us-east-1:122796619775:control/aws-foundational-security-best-practices/v/1.0.0/Macie.1" -> "arn:aws:securityhub:us-east-1:122796619775:control/nist-800-53/v/5.0.0/Macie.1" # forces replacement
      ~ title                     = "Macie should be enabled" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_securityhub_standards_control.nist_control_macie_2 must be replaced
-/+ resource "aws_securityhub_standards_control" "nist_control_macie_2" {
      ~ control_id                = "Macie.2" -> (known after apply)
      ~ control_status_updated_at = "2024-03-05T00:26:22Z" -> (known after apply)
      ~ description               = "This control checks whether automated sensitive data discovery is enabled for an Amazon Macie administrator account. The control fails if automated sensitive data discovery isn't enabled for a Macie administrator account. The control doesn't generate a finding for member accounts." -> (known after apply)
      ~ id                        = "arn:aws:securityhub:us-east-1:122796619775:control/aws-foundational-security-best-practices/v/1.0.0/Macie.2" -> (known after apply)
      ~ related_requirements      = [] -> (known after apply)
      ~ remediation_url           = "https://docs.aws.amazon.com/console/securityhub/Macie.2/remediation" -> (known after apply)
      ~ severity_rating           = "HIGH" -> (known after apply)
      ~ standards_control_arn     = "arn:aws:securityhub:us-east-1:122796619775:control/aws-foundational-security-best-practices/v/1.0.0/Macie.2" -> "arn:aws:securityhub:us-east-1:122796619775:control/nist-800-53/v/5.0.0/Macie.2" # forces replacement
      ~ title                     = "Macie automated sensitive data discovery should be enabled" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_securityhub_standards_control.nist_control_s3_15 will be created
  + resource "aws_securityhub_standards_control" "nist_control_s3_15" {
      + control_id                = (known after apply)
      + control_status            = "DISABLED"
      + control_status_updated_at = (known after apply)
      + description               = (known after apply)
      + disabled_reason           = "Not a moderate level control"
      + id                        = (known after apply)
      + related_requirements      = (known after apply)
      + remediation_url           = (known after apply)
      + severity_rating           = (known after apply)
      + standards_control_arn     = "arn:aws:securityhub:us-east-1:122796619775:control/nist-800-53/v/5.0.0/S3.15"
      + title                     = (known after apply)
    }

  # aws_securityhub_standards_subscription.best_practices will be destroyed
  # (because aws_securityhub_standards_subscription.best_practices is not in configuration)
  - resource "aws_securityhub_standards_subscription" "best_practices" {
      - id            = "arn:aws:securityhub:us-east-1:122796619775:subscription/aws-foundational-security-best-practices/v/1.0.0" -> null
      - standards_arn = "arn:aws:securityhub:us-east-1::standards/aws-foundational-security-best-practices/v/1.0.0" -> null
    }

  # aws_securityhub_standards_subscription.cis will be destroyed
  # (because aws_securityhub_standards_subscription.cis is not in configuration)
  - resource "aws_securityhub_standards_subscription" "cis" {
      - id            = "arn:aws:securityhub:us-east-1:122796619775:subscription/cis-aws-foundations-benchmark/v/1.2.0" -> null
      - standards_arn = "arn:aws:securityhub:::ruleset/cis-aws-foundations-benchmark/v/1.2.0" -> null
    }

  # aws_securityhub_standards_subscription.nist_800_53 will be created
  + resource "aws_securityhub_standards_subscription" "nist_800_53" {
      + id            = (known after apply)
      + standards_arn = "arn:aws:securityhub:us-east-1::standards/nist-800-53/v/5.0.0"
    }

Plan: 6 to add, 0 to change, 6 to destroy.
```